// Визначити у скількі разів значення дробової частини більше за значення цілої.
// Округлити результат до двох знаків після коми.
int main() {
        const float num = 123.456 ; // Задане число
        float drob = num - (int)num ; // Обчислення дробової частини числа
        int flag = num ; // Копія заданого числа 
        int roz = 1 ; // Розрядність
        float risn ; // Різниця дробової та цілої частини
        // Визначення числа на яке потрібно домножити дробну частину
        while (flag != 0) {
                 roz *= 10 ;
                 flag /= 10 ; 
        }
        drob *= roz ; // Домноження дробної частини
        if ((int)num != 0) {
                risn = drob / (int)num ; // Різниця дробної та цілої частини 
        } else {
            risn = 0 ; // Рішення у випадку якщо ціла частина дорівнює нулю
        }  
        // Округлення числа до двох знаків після коми
        risn = risn * 100 ;
        risn = (int)risn ;
        risn /= 100 ; 
        return 0 ;
}
        
